//=========================================================================== //
// Инициализация устройства
//==============================================================================

#ifndef INIT_H
#define INIT_H

#include <Arduino.h>

#include "core/tasks.h"
#include "core/utils.h"

#include "led.h"
#include "coils/unitController.h"

#include "config.h"
#include "dev-worker.h"

//------------------------------------------------------------------------------
// Периферия
//------------------------------------------------------------------------------

extern LED led;

//------------------------------------------------------------------------------

// Инициализация периферии, создание объектов
void systemInit();

#endif