//============================================================== // Globo Shield
// Светодиодная индикация
//==============================================================================

#ifndef LED_H
#define LED_H

#include <Arduino.h>

#include "core/tasks.h"

//------------------------------------------------------------------------------

// Светодиод
class LED
{
public:
  LED(const uint8_t _pin);
  ~LED();

  // Установка яркости
  void setPWM(uint8_t _pwm);
  // Получение текущей яркости
  uint8_t getPWM();
  // Включен ли светодиод
  bool isOn;
  // Вкл. на полную
  void on();
  // Выкл.
  void off();
  // Мигания
  void blinkOK();
  void blinkERROR();

protected:
  // Пин светодиода
  uint8_t pin;
  // Текущее значение ШИМ
  uint8_t pwm;
};

//------------------------------------------------------------------------------

extern LED led;

#endif